Revit 2024 API
ThermalAsset.EqualsThermalOnly Method
 Determines whether this thermal asset is equal to another, but ignore data from base class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool EqualsThermalOnly(
	ThermalAsset other
)
Visual Basic
Public Function EqualsThermalOnly ( _
	other As ThermalAsset _
) As Boolean
Visual C++
public:
bool EqualsThermalOnly(
	ThermalAsset^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ThermalAsset
 The thermal asset to compare with this one.
Return Value
 True if the given thermal asset is equal to this one, otherwise false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ThermalAsset Class
Autodesk.Revit.DB Namespace